-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Авг 27 2023 г., 19:36
-- Версия сервера: 10.4.28-MariaDB
-- Версия PHP: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `company_data`
--

-- --------------------------------------------------------

--
-- Структура таблицы `company_type`
--

CREATE TABLE `company_type` (
  `id` int(11) NOT NULL,
  `type` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `company_type`
--

INSERT INTO `company_type` (`id`, `type`) VALUES
(1, 'LEGAL'),
(2, 'INDIVIDUAL');

-- --------------------------------------------------------

--
-- Структура таблицы `data`
--

CREATE TABLE `data` (
  `id` int(11) NOT NULL,
  `company_type` int(255) NOT NULL,
  `company_name` varchar(255) NOT NULL,
  `inn` bigint(15) NOT NULL,
  `ogrn` bigint(15) NOT NULL,
  `manager_post` varchar(255) NOT NULL,
  `manager_name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `full_adress` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `data`
--

INSERT INTO `data` (`id`, `company_type`, `company_name`, `inn`, `ogrn`, `manager_post`, `manager_name`, `email`, `phone`, `full_adress`) VALUES
(30, 2, 'ИП Мясина Елена Анатольевна', 500100732259, 304500116000157, '', '', '', '', '143900, Московская обл, г Балашиха'),
(31, 1, 'ПАО СБЕРБАНК', 7707083893, 1027700132195, 'ПРЕЗИДЕНТ, ПРЕДСЕДАТЕЛЬ ПРАВЛЕНИЯ', 'Греф Герман Оскарович', '', '', '117312, г Москва, Академический р-н, ул Вавилова, д 19'),
(32, 1, 'БАЙКАЛЬСКИЙ БАНК ПАО СБЕРБАНК', 7707083893, 1027700132195, '', '', '', '', '664011, Иркутская обл, г Иркутск, Кировский р-н, ул Нижняя Набережная, д 10'),
(33, 1, 'ДАЛЬНЕВОСТОЧНЫЙ БАНК ПАО СБЕРБАНК', 7707083893, 1027700132195, '', '', '', '', '680020, Хабаровский край, г Хабаровск, ул Гамарника, д 12'),
(34, 1, 'ЗАПАДНО-СИБИРСКОЕ ОТДЕЛЕНИЕ №8647', 7707083893, 1027700132195, '', '', '', '', '625023, Тюменская обл, г Тюмень, ул Рижская, д 61'),
(35, 1, 'МОСКОВСКИЙ БАНК ПАО СБЕРБАНК', 7707083893, 1027700132195, '', '', '', '', '109544, г Москва, Таганский р-н, ул Большая Андроньевская, д 6'),
(52, 2, 'ИП Мясина Елена Анатольевна', 500100732259, 304500116000157, '', '', '', '', '143900, Московская обл, г Балашиха'),
(53, 2, 'ИП Мясина Елена Анатольевна', 500100732259, 304500116000157, '', '', '', '', '143900, Московская обл, г Балашиха'),
(54, 2, 'ИП Мясина Елена Анатольевна', 500100732259, 304500116000157, '', '', '', '', '143900, Московская обл, г Балашиха'),
(55, 2, 'ИП Мясина Елена Анатольевна', 500100732259, 304500116000157, '', '', '', '', '143900, Московская обл, г Балашиха'),
(56, 1, 'АО \"123 АРЗ\"', 5322010620, 1065332010809, '', '', '', '', '175201, Новгородская обл, Старорусский р-н, г Старая Русса, мкр Городок'),
(57, 1, 'ООО \"123\"', 5904269950, 1125904008900, 'ГЕНЕРАЛЬНЫЙ ДИРЕКТОР', 'Уразов Айрат Ханафиевич', '', '', '614000, КРАЙ ПЕРМСКИЙ, Г. ПЕРМЬ, УЛ. МОНАСТЫРСКАЯ, Д. 57, ЭТАЖ 8 (ПРАВОЕ КРЫЛО), ОФИС 801'),
(58, 1, 'ООО \"123\"', 2310190612, 1162375000809, 'ДИРЕКТОР', 'Енгибарян Левон Сергеевич', '', '', '350051, Краснодарский край, г Краснодар, ул Дальняя, д 8 к 1, кв 315'),
(59, 1, 'ОАО \"АВТОКОЛОННА №1230\"', 4501000094, 1024500508042, 'ГЕНЕРАЛЬНЫЙ ДИРЕКТОР', 'Яковлев Сергей Анатольевич', '', '', '640027, Курганская обл, г Курган, ул Омская, д 145'),
(60, 1, 'ООО \"АГРО 123\"', 6163072919, 1056163010177, 'ДИРЕКТОР', 'Скобелева Анастасия Сергеевна', '', '', '346772, Ростовская область, Р-Н АЗОВСКИЙ, С. КРУГЛОЕ, УЛ. СТЕПНАЯ, Д. 1-Ж, ЛИТЕР Г, КОМ. 1'),
(61, 1, 'ООО \"ТЕСТ\"', 2727020780, 1022700525363, 'ГЕНЕРАЛЬНЫЙ ДИРЕКТОР', 'Радина Ульяна Владимировна', '', '', '681000, Хабаровский край, г Комсомольск-на-Амуре, ул Лесозаводская, д 6');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `company_type`
--
ALTER TABLE `company_type`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `data`
--
ALTER TABLE `data`
  ADD PRIMARY KEY (`id`),
  ADD KEY `company_type` (`company_type`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `company_type`
--
ALTER TABLE `company_type`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `data`
--
ALTER TABLE `data`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `data`
--
ALTER TABLE `data`
  ADD CONSTRAINT `data_ibfk_1` FOREIGN KEY (`company_type`) REFERENCES `company_type` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
